# DirectShapeReferenceOptions Constructor (DirectShapeReferenceOptions)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DirectShapeReferenceOptions Constructor (DirectShapeReferenceOptions)
DirectShapeReferenceOptions Class See Also
---
Constructs a new copy of the input DirectShapeRefOptions object.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022
# Syntax
C#
---
```text
public DirectShapeReferenceOptions(
	DirectShapeReferenceOptions other
)
```

Visual Basic
---
```text
Public Sub New ( _
	other As DirectShapeReferenceOptions _
)
```

Visual C++
---
```text
public:
DirectShapeReferenceOptions(
	DirectShapeReferenceOptions^ other
)
```

# ### Parameters
other
    Type: Autodesk.Revit.DB..::..DirectShapeReferenceOptions
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
DirectShapeReferenceOptions Class
DirectShapeReferenceOptions Overload
Autodesk.Revit.DB Namespace